import React from 'react'
import Title from '../components/Title'
import { assets } from '../assets/assets'
import NewsletterBox from '../components/NewsletterBox'

const About = () => {
  return (
    <div>

      <div className='text-2xl text-center pt-8 border-t'>
        <Title text1={'ПРО'} text2={'НАС'} /> 
      </div>

      <div className='my-10 flex flex-col md:flex-row gap-16'>
        <img className='w-full md:max-w-[450px]' src={assets.about_img} alt='' />
        <div className='flex flex-col justify-center gap-6 md:w-2/4 text-gray-600'>
          <p>Blanco - це молодий український бренд базового жіночого одягу заснований у 2021 в Одесі. Засновниця Діана Малютяк завжди хотіла щоб одяг був максимально зручним, комфортним та стильним водночас. Не менш важливою складовою є ціновий діапазон, ми завжди намагаємось виготовляти максимально якісний та доступний продукт.</p>
          <p>В першій колекції були представлені речі виключно з натуральних тканин: світшоти, худі, джогери, шорти та футболки. І до сьогоднішнього дня в нашому каталозі переважають натуральні тканини, базові та універсальні речі.</p>
          <b className='text-gray-800'>Наша місія</b>
          <p>Основною задачею стояло щоб дівчата за допомогою нашого одягу відчували себе впевненішими. Це історія не лише про короткі міні, а навпаки про одяг, який не буде затьмарювати внутрішнє сяйво його власниці. Ажде кожна дівчина по-своєму прекрасна, а наш одяг створений для того щоб підкреслити цю красу.</p>
        </div>
      </div>

      <div className='text-xl py-4'>
        <Title text1={'ЧОМУ'} text2={'ВАРТО ОБРАТИ НАС'} />
      </div>

      <div className='flex flex-col md:flex-row text-sm mb-20'>
        <div className='border px-10 md:px-16 py-8 sm:py-20 flex flex-col gap-5'>
          <b>Забезпечення якості:</b>
          <p className='text-gray-600'>Забезпечення якості — це сукупність заходів, спрямованих на запобігання помилкам у процесі виробництва чи надання послуг. Його мета — гарантувати стабільну якість продукції, дотримання стандартів і задоволення очікувань клієнтів. Забезпечення якості включає планування, контроль процесів і постійне вдосконалення.</p>
        </div>
        <div className='border px-10 md:px-16 py-8 sm:py-20 flex flex-col gap-5'>
          <b>Зручність:</b>
          <p className=''>Зручність одягу — це здатність одягу забезпечувати комфорт під час носіння, не обмежуючи рухів і не викликаючи дискомфорту. Вона залежить від матеріалів, крою, посадки та врахування потреб користувача. Зручний одяг сприяє хорошому самопочуттю та впевненості в повсякденному житті.</p>
        </div>
        <div className='border px-10 md:px-16 py-8 sm:py-20 flex flex-col gap-5'>
          <b>Обслуговування клієнтів:</b>
          <p className=''>Обслуговування клієнтів — це процес взаємодії з покупцями для задоволення їхніх потреб до, під час і після покупки. Високий рівень обслуговування включає швидке реагування, ввічливість, допомогу у виборі товару та післяпродажну підтримку, що формує довіру й лояльність клієнтів.</p>
        </div>
      </div>

      <NewsletterBox/>

    </div>
  )
}

export default About